<template>
  <div class="document-body">
    <h2>Коммерческое предложение по созданию веб-сайта.</h2>
    
    <p>
      Мы предлагаем разработку эффективного продающего сайта по отлаженной
      рабочей схеме. Это позволяет получить действительно мощный бизнес-ресурс,
      приносящий прибыль вашей компании. 
    </p>

    <h2>ЭТАПЫ И ВИДЫ РАБОТ</h2>

    <Table :tableHeader="stepOne" :tableContent="tableOne"></Table>

    <Table :tableHeader="stepTwo" :tableContent="tableTwo"></Table>

    <Table :tableHeader="stepThree" :tableContent="tableThree"></Table>      
    </div>
</template>

<script>
import Table from "./Table"

export default{
  name: "KP",
  components: {
    Table
  },
  data() {
    return {
      tableOne: [
        {
        "columnName": "ИСПОЛНИТЕЛЬ",
        "points": [
          "Запрашивает все исходные данные, пожелания для оценки трудоемкости и стоимости проекта",
          "Изучает конкурентов, и если есть - то старый сайт заказчика", 
          "Формирует базовое описание проекта и оценивает стоимость"] 
        }, 
        {
        "columnName": "ЗАКАЗЧИК",
        "points": [
          "Предоставляет необходимую информацию и отвечает на вопросы",
          "Согласует стоимость и требования к сайту"] 
        }, 
        {
        "columnName": "РЕЗУЛЬТАТЫ",
        "points": [
          "У обоих сторон есть общее видение проекта, понимание целей и задач будущего сайта",
          "Определена стоимость и сроки разработки"] 
        }, 
      ], 
      tableTwo: [
        {
        "columnName": "ИСПОЛНИТЕЛЬ",
        "points": [
          "Предоставляет договор на подпись." ,
          "Обсуждает и корректирует ТЗ с заказчиком",
          "Создает технический макет главной страницы",
          "Готовит список информации, которую должен предоставить заказчик для наполнения сайта",
          "Разработка демо версии сайта в течении 2-3 недель"] 
        }, 
        {
        "columnName": "ЗАКАЗЧИК",
        "points": [
          "Согласует и подписывает договор, оплачивает аванс после разработки демки",
          "Обсуждает и согласует общее ТЗ на сайт, технический макет главной страницы",
          "Утверждает список информации для наполнения сайта и сроки ее предоставления"] 
        }, 
        {
        "columnName": "РЕЗУЛЬТАТЫ",
        "points": [
          "Есть готовое ТЗ на разработку сайта, в котором четко и детально прописаны \
            все требования (любые изменения ТЗ в будущем могут влиять на стоимость проекта)",
          "Все договоренности закреплены в договоре и подтверждены демо версией сайта и авансовым платежом",  
          "Заказчик имеет четкое представление какую информацию и в какие сроки он обязан предоставить"] 
        }, 
      ], 
      tableThree: [
        {
        "columnName": "ИСПОЛНИТЕЛЬ",
        "points": [
          "Исполнитель тестирует все функции сайта", 
          "Проверяет соответствие сайта общему ТЗ",
          "Предоставляет заказчику инструкцию по пользованию админ-панелью и все доступы по проекту",
          "Передает проект заказчику"
        ] 
        }, 
        {
        "columnName": "ЗАКАЗЧИК",
        "points": [
          "Проверяет сайт согласно общему ТЗ",
          "Формулирует замечания если необходимо",
          "Принимает проект",
          "Оплачивает второй платеж за услуги",] 
        }, 
        {
        "columnName": "РЕЗУЛЬТАТЫ",
        "points": [
          "Проект сдан заказчику и готов к приему посетителей"] 
        }, 
      ], 
      stepOne: "Этап 1. Оценка проекта",
      stepTwo: "Этап 2. Разработка ТЗ",
      stepThree: "Этап 3. Сдача проекта",
    }
  }
}
</script>